node {
  name: "fifo_queue"
  op: "FIFOQueueV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 1
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_INT32
        type: DT_BOOL
        type: DT_UINT8
        type: DT_STRING
        type: DT_INT32
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 84
          }
          dim {
            size: 84
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 18
          }
        }
        shape {
          dim {
            size: 21
          }
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "buffer"
    }
  }
}
node {
  name: "num_environment_frames/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@num_environment_frames"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "num_environment_frames"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@num_environment_frames"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "num_environment_frames/Assign"
  op: "Assign"
  input: "num_environment_frames"
  input: "num_environment_frames/Initializer/zeros"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@num_environment_frames"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "num_environment_frames/read"
  op: "Identity"
  input: "num_environment_frames"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@num_environment_frames"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "fifo_queue_DequeueMany/n"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 8
      }
    }
  }
}
node {
  name: "fifo_queue_DequeueMany"
  op: "QueueDequeueManyV2"
  input: "fifo_queue"
  input: "fifo_queue_DequeueMany/n"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 8
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 21
          }
          dim {
            size: 84
          }
          dim {
            size: 84
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 21
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 21
          }
          dim {
            size: 18
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 21
          }
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_INT32
        type: DT_BOOL
        type: DT_UINT8
        type: DT_STRING
        type: DT_INT32
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "transpose/perm"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "transpose"
  op: "Transpose"
  input: "fifo_queue_DequeueMany:3"
  input: "transpose/perm"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
      }
    }
  }
}
node {
  name: "transpose_1/perm"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "transpose_1"
  op: "Transpose"
  input: "fifo_queue_DequeueMany:4"
  input: "transpose_1/perm"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
      }
    }
  }
}
node {
  name: "transpose_2/perm"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "transpose_2"
  op: "Transpose"
  input: "fifo_queue_DequeueMany:5"
  input: "transpose_2/perm"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
      }
    }
  }
}
node {
  name: "transpose_3/perm"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "transpose_3"
  op: "Transpose"
  input: "fifo_queue_DequeueMany:6"
  input: "transpose_3/perm"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
      }
    }
  }
}
node {
  name: "transpose_4/perm"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000\003\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "transpose_4"
  op: "Transpose"
  input: "fifo_queue_DequeueMany:7"
  input: "transpose_4/perm"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
          dim {
            size: 84
          }
          dim {
            size: 84
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "transpose_5/perm"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "transpose_5"
  op: "Transpose"
  input: "fifo_queue_DequeueMany:8"
  input: "transpose_5/perm"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
      }
    }
  }
}
node {
  name: "transpose_6/perm"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "transpose_6"
  op: "Transpose"
  input: "fifo_queue_DequeueMany:9"
  input: "transpose_6/perm"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
      }
    }
  }
}
node {
  name: "transpose_7/perm"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transpose_7"
  op: "Transpose"
  input: "fifo_queue_DequeueMany:10"
  input: "transpose_7/perm"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
          dim {
            size: 18
          }
        }
      }
    }
  }
}
node {
  name: "transpose_8/perm"
  op: "Const"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "transpose_8"
  op: "Transpose"
  input: "fifo_queue_DequeueMany:11"
  input: "transpose_8/perm"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
      }
    }
  }
}
node {
  name: "StagingArea_root/NoOp"
  op: "NoOp"
  device: "/job:learner/task:0/device:GPU:*"
}
node {
  name: "StagingArea_put"
  op: "Stage"
  input: "fifo_queue_DequeueMany"
  input: "fifo_queue_DequeueMany:1"
  input: "fifo_queue_DequeueMany:2"
  input: "transpose"
  input: "transpose_1"
  input: "transpose_2"
  input: "transpose_3"
  input: "transpose_4"
  input: "transpose_5"
  input: "transpose_6"
  input: "transpose_7"
  input: "transpose_8"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@StagingArea_root/NoOp"
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 0
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtypes"
    value {
      list {
        type: DT_STRING
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_INT32
        type: DT_BOOL
        type: DT_UINT8
        type: DT_STRING
        type: DT_INT32
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "memory_limit"
    value {
      i: 0
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "StagingArea"
    }
  }
}
node {
  name: "StagingArea_get"
  op: "Unstage"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@StagingArea_root/NoOp"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 8
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 8
          }
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
          dim {
            size: 84
          }
          dim {
            size: 84
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
          dim {
            size: 18
          }
        }
        shape {
          dim {
            size: 21
          }
          dim {
            size: 8
          }
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 0
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtypes"
    value {
      list {
        type: DT_STRING
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_INT32
        type: DT_BOOL
        type: DT_UINT8
        type: DT_STRING
        type: DT_INT32
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "memory_limit"
    value {
      i: 0
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "StagingArea"
    }
  }
}
node {
  name: "NoOp"
  op: "NoOp"
  device: "/job:learner/task:0/device:GPU:*"
}
node {
  name: "agent/unroll/batch_apply/Reshape/shape"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 168
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape"
  op: "Reshape"
  input: "StagingArea_get:9"
  input: "agent/unroll/batch_apply/Reshape/shape"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_1/shape"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 168
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_1"
  op: "Reshape"
  input: "StagingArea_get:3"
  input: "agent/unroll/batch_apply/Reshape_1/shape"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_2/shape"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 168
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_2"
  op: "Reshape"
  input: "StagingArea_get:4"
  input: "agent/unroll/batch_apply/Reshape_2/shape"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_3/shape"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 168
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_3"
  op: "Reshape"
  input: "StagingArea_get:5"
  input: "agent/unroll/batch_apply/Reshape_3/shape"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_4/shape"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 168
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_4"
  op: "Reshape"
  input: "StagingArea_get:6"
  input: "agent/unroll/batch_apply/Reshape_4/shape"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_5/shape"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\250\000\000\000T\000\000\000T\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_5"
  op: "Reshape"
  input: "StagingArea_get:7"
  input: "agent/unroll/batch_apply/Reshape_5/shape"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
          dim {
            size: 84
          }
          dim {
            size: 84
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_6/shape"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 168
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/Reshape_6"
  op: "Reshape"
  input: "StagingArea_get:8"
  input: "agent/unroll/batch_apply/Reshape_6/shape"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/ToFloat"
  op: "Cast"
  input: "agent/unroll/batch_apply/Reshape_5"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
          dim {
            size: 84
          }
          dim {
            size: 84
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/truediv/y"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 255.0
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/truediv"
  op: "RealDiv"
  input: "agent/unroll/batch_apply/ToFloat"
  input: "agent/unroll/batch_apply/truediv/y"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
          dim {
            size: 84
          }
          dim {
            size: 84
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.192450091243
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 1
    }
  }
  attr {
    key: "seed2"
    value {
      i: 49
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal/TruncatedNormal"
  input: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal"
  op: "Add"
  input: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal/mul"
  input: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/w"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/w/Assign"
  op: "Assign"
  input: "agent/batch_apply/convnet/conv_2d/w"
  input: "agent/batch_apply/convnet/conv_2d/w/Initializer/truncated_normal"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/w/read"
  op: "Identity"
  input: "agent/batch_apply/convnet/conv_2d/w"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/convnet/conv_2d/convolution/dilation_rate"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/convnet/conv_2d/convolution"
  op: "Conv2D"
  input: "agent/unroll/batch_apply/truediv"
  input: "agent/batch_apply/convnet/conv_2d/w/read"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
          dim {
            size: 84
          }
          dim {
            size: 84
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/b/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/b"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 16
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/b"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/b"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 16
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/b/Assign"
  op: "Assign"
  input: "agent/batch_apply/convnet/conv_2d/b"
  input: "agent/batch_apply/convnet/conv_2d/b/Initializer/zeros"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/b"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 16
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d/b/read"
  op: "Identity"
  input: "agent/batch_apply/convnet/conv_2d/b"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d/b"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 16
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/convnet/conv_2d/BiasAdd"
  op: "BiasAdd"
  input: "agent/unroll/batch_apply/convnet/conv_2d/convolution"
  input: "agent/batch_apply/convnet/conv_2d/b/read"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
          dim {
            size: 84
          }
          dim {
            size: 84
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "agent/unroll/batch_apply/convnet/max_pool/dilation_rate"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/convnet/max_pool"
  op: "MaxPool"
  input: "agent/unroll/batch_apply/convnet/conv_2d/BiasAdd"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 168
          }
          dim {
            size: 42
          }
          dim {
            size: 42
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d_1/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\020\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d_1/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d_1/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0833333358169
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d_1/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
          dim {
            size: 32
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 1
    }
  }
  attr {
    key: "seed2"
    value {
      i: 67
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal/TruncatedNormal"
  input: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d_1/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
          dim {
            size: 32
          }
        }
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal"
  op: "Add"
  input: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal/mul"
  input: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d_1/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
          dim {
            size: 32
          }
        }
      }
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d_1/w"
  op: "VariableV2"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d_1/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
          dim {
            size: 32
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d_1/w/Assign"
  op: "Assign"
  input: "agent/batch_apply/convnet/conv_2d_1/w"
  input: "agent/batch_apply/convnet/conv_2d_1/w/Initializer/truncated_normal"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d_1/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
          dim {
            size: 32
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "agent/batch_apply/convnet/conv_2d_1/w/read"
  op: "Identity"
  input: "agent/batch_apply/convnet/conv_2d_1/w"
  device: "/job:learner/task:0/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent/batch_apply/convnet/conv_2d_1/w"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 16
          }
          dim {
            size: 32
          }
        }
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/convnet/conv_2d_1/convolution/dilation_rate"
  op: "Const"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "agent/unroll/batch_apply/convnet/conv_2d_1/convolution"
  op: "Conv2D"
  input: "agent/unroll/batch_apply/convnet/max_pool"
  input: "agent/batch_apply/convnet/conv_2d_1/w/read"
  device: "/job:learner/task:0/device:GPU:*"
  attr {
